aaron-bond.better-comments
adpyke.codesnap
alfish.godot-files
bmewburn.vscode-intelephense-client
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
devsense.composer-php-vscode
devsense.intelli-php-vscode
devsense.phptools-vscode
devsense.profiler-php-vscode
donjayamanne.githistory
dustypomerleau.rust-syntax
firefox-devtools.vscode-firefox-debug
geequlim.godot-tools
kisstkondoros.vscode-gutter-preview
llvm-vs-code-extensions.vscode-clangd
ms-azuretools.vscode-containers
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-wsl
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
mtxr.sqltools
naumovs.color-highlight
oderwat.indent-rainbow
pkief.material-icon-theme
rust-lang.rust-analyzer
tyriar.luna-paint
usernamehw.errorlens
vadimcn.vscode-lldb
xdebug.php-debug
yandeu.five-server
